import random

common_nouns = [
    "время", "человек", "год", "дело", "день", "рука", "раз", "город", "слово", "место", "лицо", "друг", "глаз", "вопрос", "дом", "сторона", "страна", "мир", "случай", "голова", "ребёнок", "сила", "конец",
    "вид", "система", "часть", "работа", "жизнь","власть", "женщина", "дорога", "образ", "отец", "история", "нога", "вода", "война", "любовь", "минута", "право", "небо", "сын", "душа", "утро", "вечер", "месяц", "комната",
    "ночь", "мать", "утро", "вещь", "цель", "народ", "сердце", "шаг", "девушка", "машина", "уровень", "окно","ответ", "условие",  "начало",  "свет", "действие", "век", "школа", "газета", "плечо", "путь", "дверь",
    "язык", "любовь", "порядок", "автор", "гость", "закон", "число", "идея", "смерть", "сон", "ресурс", "лес", "проблема", "искусство", "река", "проект", "журнал", "стена", "товарищ", "книга", "письмо", "помощь", "группа", "участие",
]

def display_hagman(tryies):
    stages = [
    """
  +---+
  |   |
      |
      |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
      |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
  |   |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
 /|   |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
 /|\\ |
      |
      |
=========""",
    """
  +---+
  |   |
  O   |
 /|\\ |
 /    |
      |
=========""",
    """
  +---+
  |   |
  O   |
 /|\\ |
 / \\ |
      |
=========""",
]

def tryies1(playfield, answer):
    guess = ""
    for i in playfield:
        if i in tryies:
            guess += f"{i} "
        else:
            guess += "_ "
        return guess

def main(): 
    print("".join(answer))
    while True:    
        answer = random.choice(common_nouns)
        playfield = []
        tryies = 0
        while tryies < 7:
            gui = tryies1(playfield, answer)
            print(display_hagman[tryies])
            print(gui)
            playfield = input("Введите букву :")
            if playfield.lower() in answer and len(playfield) == 1:
                playfield.append("_")
            else:
                tryies += 1
        else:
            print("Ты выжил сынуля...")            
